; ModuleID = 'qn.c'
source_filename = "qn.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.1 = type { [11 x i32]*, %struct.qname_lpm_key*, %struct.qname_lpm_key*, [1 x i32]*, [1023 x i32]* }
%struct.qname_lpm_key = type { i32, [64 x i8] }
%struct.anon.2 = type { [2 x i32]*, i32*, i64*, [2 x i32]* }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.udphdr = type { i16, i16, i16, i16 }

@xdp_patch_ports_func.____fmt = internal constant [8 x i8] c"rev %s\0A\00", align 1, !dbg !0
@main_map = dso_local global %struct.anon.1 zeroinitializer, section ".maps", align 8, !dbg !94
@xdp_patch_ports_func.____fmt.1 = internal constant [12 x i8] c"k index %d\0A\00", align 1, !dbg !78
@xdp_patch_ports_func.____fmt.2 = internal constant [16 x i8] c"matched len %d\0A\00", align 1, !dbg !84
@stats_map = dso_local global %struct.anon.2 zeroinitializer, section ".maps", align 8, !dbg !123
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !89

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 150, type: !236, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "xdp_patch_ports_func", scope: !3, file: !3, line: 83, type: !4, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !158)
!3 = !DIFile(filename: "qn.c", directory: "/root/multi-filters/qname_filter", checksumkind: CSK_MD5, checksum: "8b180f3173b36b1937b3f8c2b6f9b132")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !9, line: 5944, size: 192, elements: !10)
!9 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/root/multi-filters/qname_filter", checksumkind: CSK_MD5, checksum: "19e7a278dd5e69adb087c419977e86e0")
!10 = !{!11, !15, !16, !17, !18, !19}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !8, file: !9, line: 5945, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !8, file: !9, line: 5946, baseType: !12, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !8, file: !9, line: 5947, baseType: !12, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !8, file: !9, line: 5949, baseType: !12, size: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !8, file: !9, line: 5950, baseType: !12, size: 32, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !8, file: !9, line: 5952, baseType: !12, size: 32, offset: 160)
!20 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !66, globals: !77, splitDebugInlining: false, nameTableKind: None)
!21 = !{!22, !29, !60}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !9, line: 5933, baseType: !14, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!25 = !DIEnumerator(name: "XDP_DROP", value: 1)
!26 = !DIEnumerator(name: "XDP_PASS", value: 2)
!27 = !DIEnumerator(name: "XDP_TX", value: 3)
!28 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 28, baseType: !14, size: 32, elements: !31)
!30 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "9a7f04155c254fef1b7ada5eb82c984c")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!32 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!33 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!34 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!35 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!36 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!37 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!38 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!39 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!40 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!41 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!42 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!43 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!44 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!45 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!46 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!47 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!48 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!49 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!50 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!51 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!52 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!53 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!54 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!55 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!56 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!57 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!58 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!59 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 1185, baseType: !14, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "BPF_ANY", value: 0)
!63 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!64 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!65 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!66 = !{!67, !68, !69, !71, !74, !75}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!68 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !13, line: 24, baseType: !70)
!70 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !13, line: 21, baseType: !73)
!73 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !{!0, !78, !84, !89, !94, !123, !139, !146, !153}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 156, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 96, elements: !82)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!82 = !{!83}
!83 = !DISubrange(count: 12)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 160, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 128, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 16)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "_license", scope: !20, file: !3, line: 186, type: !91, isLocal: false, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 4)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "main_map", scope: !20, file: !3, line: 28, type: !96, isLocal: false, isDefinition: true)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 22, size: 320, elements: !97)
!97 = !{!98, !103, !112, !113, !118}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !96, file: !3, line: 23, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 352, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 11)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !96, file: !3, line: 24, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qname_lpm_key", file: !3, line: 17, size: 544, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !105, file: !3, line: 18, baseType: !12, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "rev_suf", scope: !105, file: !3, line: 19, baseType: !109, size: 512, offset: 32)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !96, file: !3, line: 25, baseType: !104, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !96, file: !3, line: 26, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !96, file: !3, line: 27, baseType: !119, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32736, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 1023)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "stats_map", scope: !20, file: !3, line: 35, type: !125, isLocal: false, isDefinition: true)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 30, size: 256, elements: !126)
!126 = !{!127, !132, !134, !138}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !3, line: 31, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 2)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !125, file: !3, line: 32, baseType: !133, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !125, file: !3, line: 33, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !13, line: 31, baseType: !137)
!137 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !125, file: !3, line: 34, baseType: !128, size: 64, offset: 192)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !20, file: !141, line: 176, type: !142, isLocal: true, isDefinition: true)
!141 = !DIFile(filename: "../lib/libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/root/multi-filters/qname_filter", checksumkind: CSK_MD5, checksum: "32b0945df61015e3dd6be9ac5ea42778")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!68, !145, !12, null}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !20, file: !141, line: 55, type: !148, isLocal: true, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!67, !67, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !20, file: !141, line: 77, type: !155, isLocal: true, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!68, !67, !151, !151, !136}
!158 = !{!159, !160, !161, !162, !163, !176, !177, !178, !179, !180, !185, !216, !217, !220, !229, !230, !231, !234, !235}
!159 = !DILocalVariable(name: "ctx", arg: 1, scope: !2, file: !3, line: 83, type: !7)
!160 = !DILocalVariable(name: "action", scope: !2, file: !3, line: 85, type: !6)
!161 = !DILocalVariable(name: "eth_type", scope: !2, file: !3, line: 86, type: !6)
!162 = !DILocalVariable(name: "ip_type", scope: !2, file: !3, line: 86, type: !6)
!163 = !DILocalVariable(name: "eth", scope: !2, file: !3, line: 87, type: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !166, line: 168, size: 112, elements: !167)
!166 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!167 = !{!168, !172, !173}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !165, file: !166, line: 169, baseType: !169, size: 48)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 48, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 6)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !165, file: !166, line: 170, baseType: !169, size: 48, offset: 48)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !165, file: !166, line: 171, baseType: !174, size: 16, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !175, line: 25, baseType: !69)
!175 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!176 = !DILocalVariable(name: "stk", scope: !2, file: !3, line: 88, type: !12)
!177 = !DILocalVariable(name: "stptr", scope: !2, file: !3, line: 89, type: !135)
!178 = !DILocalVariable(name: "data_end", scope: !2, file: !3, line: 90, type: !67)
!179 = !DILocalVariable(name: "data", scope: !2, file: !3, line: 91, type: !67)
!180 = !DILocalVariable(name: "nh", scope: !2, file: !3, line: 92, type: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !182, line: 33, size: 64, elements: !183)
!182 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/root/multi-filters/qname_filter", checksumkind: CSK_MD5, checksum: "172efdd203783aed49c0ce78645261a8")
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !181, file: !182, line: 34, baseType: !67, size: 64)
!185 = !DILocalVariable(name: "iph", scope: !186, file: !3, line: 100, type: !188)
!186 = distinct !DILexicalBlock(scope: !187, file: !3, line: 99, column: 39)
!187 = distinct !DILexicalBlock(scope: !2, file: !3, line: 99, column: 6)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !190, line: 87, size: 160, elements: !191)
!190 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200, !202}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !189, file: !190, line: 89, baseType: !72, size: 4, flags: DIFlagBitField, extraData: i64 0)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !189, file: !190, line: 90, baseType: !72, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !189, file: !190, line: 97, baseType: !72, size: 8, offset: 8)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !189, file: !190, line: 98, baseType: !174, size: 16, offset: 16)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !189, file: !190, line: 99, baseType: !174, size: 16, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !189, file: !190, line: 100, baseType: !174, size: 16, offset: 48)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !189, file: !190, line: 101, baseType: !72, size: 8, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !189, file: !190, line: 102, baseType: !72, size: 8, offset: 72)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !189, file: !190, line: 103, baseType: !201, size: 16, offset: 80)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !175, line: 31, baseType: !69)
!202 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !190, line: 104, baseType: !203, size: 64, offset: 96)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !190, line: 104, size: 64, elements: !204)
!204 = !{!205, !211}
!205 = !DIDerivedType(tag: DW_TAG_member, scope: !203, file: !190, line: 104, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !203, file: !190, line: 104, size: 64, elements: !207)
!207 = !{!208, !210}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !206, file: !190, line: 104, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !175, line: 27, baseType: !12)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !206, file: !190, line: 104, baseType: !209, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !203, file: !190, line: 104, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !203, file: !190, line: 104, size: 64, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !212, file: !190, line: 104, baseType: !209, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !212, file: !190, line: 104, baseType: !209, size: 32, offset: 32)
!216 = !DILocalVariable(name: "hdrsize", scope: !186, file: !3, line: 101, type: !6)
!217 = !DILocalVariable(name: "udppld", scope: !218, file: !3, line: 125, type: !12)
!218 = distinct !DILexicalBlock(scope: !219, file: !3, line: 124, column: 30)
!219 = distinct !DILexicalBlock(scope: !2, file: !3, line: 124, column: 6)
!220 = !DILocalVariable(name: "h", scope: !218, file: !3, line: 126, type: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !223, line: 23, size: 64, elements: !224)
!223 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!224 = !{!225, !226, !227, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !222, file: !223, line: 24, baseType: !174, size: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !222, file: !223, line: 25, baseType: !174, size: 16, offset: 16)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !222, file: !223, line: 26, baseType: !174, size: 16, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !222, file: !223, line: 27, baseType: !201, size: 16, offset: 48)
!229 = !DILocalVariable(name: "qrn", scope: !218, file: !3, line: 141, type: !69)
!230 = !DILocalVariable(name: "qlen", scope: !218, file: !3, line: 142, type: !12)
!231 = !DILocalVariable(name: "qlk", scope: !232, file: !3, line: 144, type: !105)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 143, column: 14)
!233 = distinct !DILexicalBlock(scope: !218, file: !3, line: 143, column: 6)
!234 = !DILocalVariable(name: "tval", scope: !232, file: !3, line: 151, type: !104)
!235 = !DILabel(scope: !2, name: "out", file: !3, line: 175)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 8)
!239 = !{i32 7, !"Dwarf Version", i32 5}
!240 = !{i32 2, !"Debug Info Version", i32 3}
!241 = !{i32 1, !"wchar_size", i32 4}
!242 = !{i32 7, !"frame-pointer", i32 2}
!243 = !{!"Ubuntu clang version 14.0.6"}
!244 = !DILocation(line: 0, scope: !2)
!245 = !DILocation(line: 88, column: 2, scope: !2)
!246 = !DILocation(line: 88, column: 8, scope: !2)
!247 = !{!248, !248, i64 0}
!248 = !{!"int", !249, i64 0}
!249 = !{!"omnipotent char", !250, i64 0}
!250 = !{!"Simple C/C++ TBAA"}
!251 = !DILocation(line: 90, column: 38, scope: !2)
!252 = !{!253, !248, i64 4}
!253 = !{!"xdp_md", !248, i64 0, !248, i64 4, !248, i64 8, !248, i64 12, !248, i64 16, !248, i64 20}
!254 = !DILocation(line: 90, column: 27, scope: !2)
!255 = !DILocation(line: 90, column: 19, scope: !2)
!256 = !DILocation(line: 91, column: 34, scope: !2)
!257 = !{!253, !248, i64 0}
!258 = !DILocation(line: 91, column: 23, scope: !2)
!259 = !DILocation(line: 91, column: 15, scope: !2)
!260 = !DILocalVariable(name: "nh", arg: 1, scope: !261, file: !182, line: 124, type: !264)
!261 = distinct !DISubprogram(name: "parse_ethhdr", scope: !182, file: !182, line: 124, type: !262, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !266)
!262 = !DISubroutineType(types: !263)
!263 = !{!6, !264, !67, !265}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!266 = !{!260, !267, !268}
!267 = !DILocalVariable(name: "data_end", arg: 2, scope: !261, file: !182, line: 125, type: !67)
!268 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !261, file: !182, line: 126, type: !265)
!269 = !DILocation(line: 0, scope: !261, inlinedAt: !270)
!270 = distinct !DILocation(line: 94, column: 13, scope: !2)
!271 = !DILocalVariable(name: "nh", arg: 1, scope: !272, file: !182, line: 79, type: !264)
!272 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !182, file: !182, line: 79, type: !273, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !280)
!273 = !DISubroutineType(types: !274)
!274 = !{!6, !264, !67, !265, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !182, line: 64, size: 32, elements: !277)
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !276, file: !182, line: 65, baseType: !279, size: 32)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 32, elements: !130)
!280 = !{!271, !281, !282, !283, !284, !285, !286, !292, !293}
!281 = !DILocalVariable(name: "data_end", arg: 2, scope: !272, file: !182, line: 80, type: !67)
!282 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !272, file: !182, line: 81, type: !265)
!283 = !DILocalVariable(name: "vlans", arg: 4, scope: !272, file: !182, line: 82, type: !275)
!284 = !DILocalVariable(name: "eth", scope: !272, file: !182, line: 84, type: !164)
!285 = !DILocalVariable(name: "hdrsize", scope: !272, file: !182, line: 85, type: !6)
!286 = !DILocalVariable(name: "vlh", scope: !272, file: !182, line: 86, type: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !182, line: 42, size: 32, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !288, file: !182, line: 43, baseType: !174, size: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !288, file: !182, line: 44, baseType: !174, size: 16, offset: 16)
!292 = !DILocalVariable(name: "h_proto", scope: !272, file: !182, line: 87, type: !69)
!293 = !DILocalVariable(name: "i", scope: !272, file: !182, line: 88, type: !6)
!294 = !DILocation(line: 0, scope: !272, inlinedAt: !295)
!295 = distinct !DILocation(line: 129, column: 9, scope: !261, inlinedAt: !270)
!296 = !DILocation(line: 93, column: 14, scope: !297, inlinedAt: !295)
!297 = distinct !DILexicalBlock(scope: !272, file: !182, line: 93, column: 6)
!298 = !DILocation(line: 93, column: 24, scope: !297, inlinedAt: !295)
!299 = !DILocation(line: 93, column: 6, scope: !272, inlinedAt: !295)
!300 = !DILocation(line: 99, column: 17, scope: !272, inlinedAt: !295)
!301 = !{!302, !302, i64 0}
!302 = !{!"short", !249, i64 0}
!303 = !DILocalVariable(name: "h_proto", arg: 1, scope: !304, file: !182, line: 68, type: !69)
!304 = distinct !DISubprogram(name: "proto_is_vlan", scope: !182, file: !182, line: 68, type: !305, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !307)
!305 = !DISubroutineType(types: !306)
!306 = !{!6, !69}
!307 = !{!303}
!308 = !DILocation(line: 0, scope: !304, inlinedAt: !309)
!309 = distinct !DILocation(line: 106, column: 8, scope: !310, inlinedAt: !295)
!310 = distinct !DILexicalBlock(scope: !311, file: !182, line: 106, column: 7)
!311 = distinct !DILexicalBlock(scope: !312, file: !182, line: 105, column: 39)
!312 = distinct !DILexicalBlock(scope: !313, file: !182, line: 105, column: 2)
!313 = distinct !DILexicalBlock(scope: !272, file: !182, line: 105, column: 2)
!314 = !DILocation(line: 70, column: 20, scope: !304, inlinedAt: !309)
!315 = !DILocation(line: 70, column: 46, scope: !304, inlinedAt: !309)
!316 = !DILocation(line: 106, column: 8, scope: !310, inlinedAt: !295)
!317 = !DILocation(line: 106, column: 7, scope: !311, inlinedAt: !295)
!318 = !DILocation(line: 112, column: 18, scope: !311, inlinedAt: !295)
!319 = !DILocation(line: 99, column: 15, scope: !187)
!320 = !DILocation(line: 99, column: 6, scope: !2)
!321 = !DILocation(line: 0, scope: !186)
!322 = !DILocation(line: 103, column: 11, scope: !323)
!323 = distinct !DILexicalBlock(scope: !186, file: !3, line: 103, column: 7)
!324 = !DILocation(line: 103, column: 17, scope: !323)
!325 = !DILocation(line: 103, column: 15, scope: !323)
!326 = !DILocation(line: 103, column: 7, scope: !186)
!327 = !DILocation(line: 106, column: 18, scope: !186)
!328 = !DILocation(line: 106, column: 22, scope: !186)
!329 = !DILocation(line: 108, column: 14, scope: !330)
!330 = distinct !DILexicalBlock(scope: !186, file: !3, line: 108, column: 6)
!331 = !DILocation(line: 108, column: 6, scope: !186)
!332 = !DILocation(line: 112, column: 14, scope: !333)
!333 = distinct !DILexicalBlock(scope: !186, file: !3, line: 112, column: 7)
!334 = !DILocation(line: 112, column: 24, scope: !333)
!335 = !DILocation(line: 112, column: 7, scope: !186)
!336 = !DILocation(line: 116, column: 19, scope: !186)
!337 = !{!338, !249, i64 9}
!338 = !{!"iphdr", !249, i64 0, !249, i64 0, !249, i64 1, !302, i64 2, !302, i64 4, !302, i64 6, !249, i64 8, !249, i64 9, !302, i64 10, !249, i64 12}
!339 = !DILocation(line: 124, column: 14, scope: !219)
!340 = !DILocation(line: 124, column: 6, scope: !2)
!341 = !DILocation(line: 0, scope: !218)
!342 = !DILocation(line: 128, column: 9, scope: !343)
!343 = distinct !DILexicalBlock(scope: !218, file: !3, line: 128, column: 7)
!344 = !DILocation(line: 128, column: 15, scope: !343)
!345 = !DILocation(line: 128, column: 13, scope: !343)
!346 = !DILocation(line: 128, column: 7, scope: !218)
!347 = !DILocation(line: 137, column: 22, scope: !348)
!348 = distinct !DILexicalBlock(scope: !218, file: !3, line: 137, column: 6)
!349 = !DILocation(line: 137, column: 27, scope: !348)
!350 = !DILocation(line: 137, column: 6, scope: !218)
